NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/api/device_state_manager.h
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef DEVICE_STATE_MANAGER_H__
#define DEVICE_STATE_MANAGER_H__

#include <stdbool.h>
#include <stdint.h>
#include "nrf_mesh.h"

#include "nrf_mesh_config_app.h"
#include "toolchain.h"

/**
 * @addtogroup DEVICE_STATE_MANAGER
 * @{
 */

/**
 * @defgroup DEVICE_STATE_MANAGER_DEFINES Defines
 * Device State Manager defines.
 * @{
 */

/** Maximum number of addresses in total. */
#define DSM_ADDR_MAX (DSM_VIRTUAL_ADDR_MAX + DSM_NONVIRTUAL_ADDR_MAX)
/** Invalid handle index */
#define DSM_HANDLE_INVALID  (0xFFFF)

/** Maximum key index allowed. */
#define DSM_KEY_INDEX_MAX   (NRF_MESH_GLOBAL_KEY_INDEX_MAX)

/** @} */

/**
 * @defgroup DEVICE_STATE_MANAGER_TYPES Types
 * Device State Manager types.
 * @{
 */

/** Key index type, used for network key index and application key index. */
typedef uint16_t mesh_key_index_t;
/** DSM handle type, used for the handles returned for the each set of data added. */
typedef uint16_t dsm_handle_t;

/**
 * Structure representing the unicast addresses assigned to this device.
 */
typedef struct
{
    uint16_t address_start; /**< First address in the range of unicast addresses. */
    uint16_t count;         /**< Number of addresses in the range of unicast addresses. */
} dsm_local_unicast_address_t;

/** @} */

/**
 * Initialize the device state manager.
 */
void dsm_init(void);

/**
 * Load DSM state from flash, to recover state.
 *
 * If this fails, the device will be unable to join any network it has previously been part of.
 *
 * @returns Whether there was any valid data available for loading from flash.
 */
bool dsm_flash_config_load(void);

/**
 * Check whether there's data waiting to be flashed.
 *
 * @returns Whether there's data waiting to be flashed.
 */
bool dsm_has_unflashed_data(void);

/**
 * Get a pointer to the flash area used by the device state manager.
 *
 * @returns A pointer to the device state manager flash area.
 */
const void * dsm_flash_area_get(void);

/**
 * Clear all stored state in the Device State Manager, including flash state.
 */
void dsm_clear(void);

/**
 * @defgroup DEVICE_STATE_MANAGER_ADDRESSES Address management
 * Functions for managing the set of addresses known to the device.
 * @{
 */

/**
 * Adds an address to the DSM to be used as a publish address.
 *
 * This address can be either a unicast or a group address.
 *
 * @param[in]  raw_address      The address to add to the device.
 * @param[out] p_address_handle Pointer to a variable where the handle assigned to this
 *                              address is stored.
 *
 * @retval NRF_SUCCESS             The address was successfully added.
 * @retval NRF_ERROR_INVALID_PARAM The address provided was not a unicast or group address.
 * @retval NRF_ERROR_NULL          The @c p_address_handle parameter was NULL.
 */
uint32_t dsm_address_publish_add(uint16_t raw_address, dsm_handle_t * p_address_handle);

/**
 * Adds a publication to an existing address handle.
 *
 * @param[in] address_handle handle of the address.
 *
 * @retval NRF_SUCCESS The publication was successfully added to the address.
 * @retval NRF_ERROR_NOT_FOUND The handle did not point to a previously added address.
 */
uint32_t dsm_address_publish_add_handle(dsm_handle_t address_handle);

/**
 * Adds a virtual address to the DSM to be used as a publish address.
 *
 * @param[in]  p_label_uuid     Pointer to the start of the virtual address label UUID.
 * @param[out] p_address_handle Pointer to a variable where the handle assigned to this
 *                              address is stored.
 *
 * @retval NRF_SUCCESS      The address was successfully added.
 * @retval NRF_ERROR_NULL   The @c p_address_handle parameter was NULL.
 * @retval NRF_ERROR_NO_MEM The address could not be added due to resource constraints.
 */
uint32_t dsm_address_publish_virtual_add(const uint8_t * p_label_uuid, dsm_handle_t * p_address_handle);

/**
 * Removes an address that has been used as a publish address.
 *
 * @param[in] address_handle Handle of the address to remove.
 *
 * @retval NRF_SUCCESS         The address was successfully removed.
 * @retval NRF_ERROR_NOT_FOUND The @c address_handle was not pointing to a valid address.
 */
uint32_t dsm_address_publish_remove(dsm_handle_t address_handle);

/**
 * Set the unicast addresses of the device.
 *
 * @note This function can only be called once for the lifetime of a node, unless
 * the node has been removed from the mesh and needs to be reprovisioned, in that
 * case @ref dsm_clear must be called first.
 *
 * @param[in] p_address The unicast addresses to assign to this device.
 *
 * @retval NRF_SUCCESS The addresses has been successfully assigned.
 * @retval NRF_ERROR_FORBIDDEN The unicast addresses have been set once before,
 * and the device state must be reset before they can be changed again.
 * @retval NRF_ERROR_INVALID_DATA The given address range is invalid or it
 * overlaps with non-unicast type addresses.
 */
uint32_t dsm_local_unicast_addresses_set(const dsm_local_unicast_address_t * p_address);

/**
 * Get the local unicast address range of the device.
 *
 * @param[out] p_address Returns the unicast addresses assigned to this device.
 */
void dsm_local_unicast_addresses_get(dsm_local_unicast_address_t * p_address);

/**
 * Adds the specified address to the global subscription list.
 *
 * This function can only be called for group addresses.
 *
 * @param[in]  raw_address      The raw 16-bit address to subscribe to.
 * @param[out] p_address_handle Pointer to a variable where the handle of the address is stored.
 *
 * @retval NRF_SUCCESS The given address has been successfully added to the
 * global subscription list.
 * @retval NRF_ERROR_INVALID_PARAM The provided address handle does not represent
 * a group address.
 * @retval NRF_ERROR_NO_MEM The rx list for group addresses is full, @c
 * DSM_SUBS_LIST_MAX.
 * @retval NRF_ERROR_NOT_FOUND The given address handle does not represent a
 * valid address.
 */
uint32_t dsm_address_subscription_add(uint16_t raw_address, dsm_handle_t * p_address_handle);

/**
 * Adds the specified virtual address to the global subscription list.
 *
 * @param[in]  p_label_uuid     Pointer to the start of the virtual address label UUID.
 * @param[out] p_address_handle Pointer to a variable where the handle assigned to this
 *                              address is stored.
 *
 * @retval NRF_SUCCESS      The specified address has been successfully added to the global
 *                          subscription list.
 * @retval NRF_ERROR_NO_MEM The list of RX addresses is full, @c DSM_SUBS_LIST_MAX.
 */
uint32_t dsm_address_subscription_virtual_add(const uint8_t * p_label_uuid, dsm_handle_t * p_address_handle);

/**
 * Adds a subscription to an existing address handle.
 *
 * @param[in] address_handle handle of the address.
 *
 * @retval NRF_SUCCESS The subscription was successfully added to the address.
 * @retval NRF_ERROR_NOT_FOUND The handle did not point to a previously added address.
 */
uint32_t dsm_address_subscription_add_handle(dsm_handle_t address_handle);


/**
 * Returns whether the given address_handle is in the global subscription list.
 *
 * @deprecated This function is deprecated, and the more general @ref dsm_address_is_rx
 * should be used instead.
 *
 * @param[in] address_handle The reserved handle of the address.
 *
 * @returns Whether the given address handle is present in the global subscription list.
 */
_DEPRECATED bool dsm_address_subscription_get(dsm_handle_t address_handle);

/**
 * Returns whether the device will process packets received on the given destination address.
 *
 * @param[in] p_addr The raw address to check for.
 *
 * @returns Whether the device will process packets received on the given destination address.
 */
bool dsm_address_is_rx(const nrf_mesh_address_t * p_addr);

/**
 * Returns the number of subscriptions registered for an address in the global subscription list.
 *
 * @param[in]  address_handle The reserved handle of the address.
 * @param[out] p_count        A pointer to a variable where the subscription count is stored.
 *
 * @retval NRF_SUCCESS         The subscription count was successfully returned.
 * @retval NRF_ERROR_NOT_FOUND The address was not found in the address list.
 * @retval NRF_ERROR_NULL      The @c p_count parameter was @c NULL.
 */
uint32_t dsm_address_subscription_count_get(dsm_handle_t address_handle, uint16_t * p_count);

/**
 * Removes the given address_handle from the global subscription list.
 * This function can only be called for group and virtual addresses.
 * The address will only be removed from the rx list, but it will still be available in the
 * relevant address list. Therefore, after the removal a valid address can still be
 * retreived with the same handle.
 *
 * @param[in] address_handle The reserved handle of the address.
 *
 * @retval NRF_SUCCESS The given address has been successfully removed from the rx list.
 * @retval NRF_ERROR_FORBIDDEN Unicast addresses can't be removed from the rx list.
 * @retval NRF_ERROR_NOT_FOUND The given address handle does not exist in the subscription lists.
 */
uint32_t dsm_address_subscription_remove(dsm_handle_t address_handle);

/**
 * Retrieves the address for a given address handle and fills out the given @ref nrf_mesh_address_t
 * structure.
 *
 * @param[in] address_handle The reserved handle of the address.
 * @param[in, out] p_address The address retrieved via the given @c address_handle.
 *
 * @retval NRF_SUCCESS An address has been found and returned via the @c p_address.
 * @retval NRF_ERROR_NULL Unexpected NULL pointer is given.
 * @retval NRF_ERROR_NOT_FOUND The given address handle does not exist in the subscription lists.
 */
uint32_t dsm_address_get(dsm_handle_t address_handle, nrf_mesh_address_t * p_address);

/**
 * Get a list of all address handles in the address pool.
 *
 * @param[in, out] p_address_handle_list Pointer to the array for storing all
 * the address handles.
 * @param[in, out] p_count The size of the @c p_address_handle_list array. Will
 * be changed to the number of address handles returned via the @c
 * p_address_handle_list.
 *
 * @retval NRF_SUCCESS The @c p_address_handle_list has been successfully
 * populated by all known address handles.
 * @retval NRF_ERROR_NULL An unexpected NULL pointer is given.
 * @retval NRF_ERROR_INVALID_LENGTH The @c p_address_handle_list is not large
 * enough to store all address handles, so only a partial list (the first @c
 * *p_count indices) is returned.
 */
uint32_t dsm_address_get_all(dsm_handle_t * p_address_handle_list, uint32_t * p_count);

/**
 * Retrieves the address handle for a given @ref nrf_mesh_address_t structure.
 *
 * @param[in] p_address The address.
 * @param[in, out] p_address_handle The address handle retrieved via the given @c p_address.
 *
 * @retval NRF_SUCCESS An address has been found and returned via the @c p_address.
 * @retval NRF_ERROR_NULL Unexpected NULL pointer is given.
 * @retval NRF_ERROR_NOT_FOUND The given address handle does not exist in the subscription lists.
 */
uint32_t dsm_address_handle_get(const nrf_mesh_address_t * p_address, dsm_handle_t * p_address_handle);

